In [3]:
import  pandas as pd
data=[1,2,3,4]
series1=pd.Series(data)
series1

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
type(series1)

pandas.core.series.Series

In [12]:
data1=[1,2,3,4,5]
srs=pd.Series(data1,index=['a','b','c','d','e'])
print(srs)
print(srs['a':'c'])

a    1
b    2
c    3
d    4
e    5
dtype: int64
a    1
b    2
c    3
dtype: int64

In [8]:
data2=[[1,2,3,4,5],[2,3,5]]
df=pd.DataFrame(data2)
df

   0  1  2    3    4
0  1  2  3  4.0  5.0
1  2  3  5  NaN  NaN

In [23]:
data3={'a':[1,2,3,4,5],'b':[5,6,7,8,9]}
df=pd.DataFrame(data3)
df

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
4  5  9

# dictionary dataframe

In [24]:
dict={'fruits':['apple','mango','banana'],'count':[10,12,13]}
df=pd.DataFrame(dict)
df

   fruits  count
0   apple     10
1   mango     12
2  banana     13

# series data frame

In [28]:
series=pd.Series([6,12],index=['a','b'])
df=pd.DataFrame(series)
df

    0
a   6
b  12

In [27]:
series=pd.Series([6,12],index=['a','b'])
df=pd.DataFrame([series])
df

   a   b
0  6  12

# numpy ND array dataframe

In [31]:
import numpy as np
dta=np.array([['a','b'],[6,12]])
df=pd.DataFrame({'A':dta[:,0],'B':dta[:,1]})
df

   A   B
0  a   b
1  6  12

In [32]:
dta1=[1,2]
df=pd.DataFrame(dta1)
df.rename(index={0:"a",1:"b"},inplace=True)
df.rename(index=str,columns={0:"A"},inplace=True)
df

   A
a  1
b  2

In [33]:
dta1=[1,2]
df=pd.DataFrame(dta1)
df.rename(index={0:"a",1:"b"},inplace=True)
df.rename(index=str,columns={0:"A"},inplace=True)
colList=[]
df.columns=["a"]
for col in df.columns:
    if col=="a":
        col="b"
    colList.append(col)
df.columns=colList
df

   b
a  1
b  2

# concat and merge dataframe

In [35]:
df=pd.DataFrame({"A":[1,2,3],"B":[2,3,4]})
df

   A  B
0  1  2
1  2  3
2  3  4

In [36]:
df1=pd.DataFrame({"A":[3,4,5],"C":[7,8,9]})
df1

   A  C
0  3  7
1  4  8
2  5  9

In [37]:
pd.concat([df,df1])

   A    B    C
0  1  2.0  NaN
1  2  3.0  NaN
2  3  4.0  NaN
0  3  NaN  7.0
1  4  NaN  8.0
2  5  NaN  9.0

In [38]:
pd.concat([df,df1],axis=1,join="inner")

   A  B  A  C
0  1  2  3  7
1  2  3  4  8
2  3  4  5  9

In [39]:
pd.concat([df,df1],axis=0,join="inner")

   A
0  1
1  2
2  3
0  3
1  4
2  5

In [40]:
pd.merge(df,df1,on=["A"],how="inner")

   A  B  C
0  3  4  7

In [41]:
pd.merge(df,df1,how="right")

   A    B  C
0  3  4.0  7
1  4  NaN  8
2  5  NaN  9

In [42]:
pd.merge(df,df1,how="left")

   A  B    C
0  1  2  NaN
1  2  3  NaN
2  3  4  7.0

In [43]:
pd.merge(df,df1,how="outer")

   A    B    C
0  1  2.0  NaN
1  2  3.0  NaN
2  3  4.0  7.0
3  4  NaN  8.0
4  5  NaN  9.0